<details><summary>Digger run report at 2023-07-26 16:02:34 (UTC)</summary>
  <details><summary>Apply for <b>nhamcloudlab/digger_demo_multienv#prod</b></summary>
  
```terraform
Terraform will perform the following actions:

  # aws_iam_role.test_role2 will be created
  + resource "aws_iam_role" "test_role2" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "test_role2"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "tag-key" = "tag-value"
        }
      + tags_all              = {
          + "tag-key" = "tag-value"
        }
      + unique_id             = (known after apply)
    }

  # null_resource.test_prod will be created
  + resource "null_resource" "test_prod" {
      + id = (known after apply)
    }

  # null_resource.test_prod2223 will be created
  + resource "null_resource" "test_prod2223" {
      + id = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
null_resource.test_prod2223: Creating...
null_resource.test_prod2223: Creation complete after 0s [id=2406063227317462604]
null_resource.test_prod: Creating...
null_resource.test_prod: Creation complete after 0s [id=6869555155988583991]
aws_iam_role.test_role2: Creating...
aws_iam_role.test_role2: Creation complete after 0s [id=test_role2]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.

  ```
</details>
</details>